// Инициализация указателя на начало экрана
@16384
D = A

@0
M = M + D

// 1 строка (0001110000111000 -> 7224)
@7224
D=A

@0
A=M
M=D

// переход к 2 строке
@32
D=A

@0
M=M+D

// 2 строка (0001110000111000 -> 7224)
@7224
D=A

@0
A=M
M=D

// переход к 3 строке
@32
D=A

@0
M=M+D

// 3 строка (0001110000111000 -> 7224)
@7224
D=A

@0
A=M
M=D

// переход к 6 строке
@32
D=A

@0
M=M+D
M=M+D
M=M+D

// 6 строка (0110000000000110 -> 24582)

@24582
D=A

@0
A=M
M=D

// переход к 7 строке
@32
D=A

@0
M=M+D

// 7 строка (0011100000011100 -> 14364)

@14364
D=A

@0
A=M
M=D

// переход к 8 строке
@32
D=A

@0
M=M+D

// 8 строка (0000111111110000 -> 4080)

@4080
D=A

@0
A=M
M=D